%% Смеситель
clc; clear;

Params = BaseParamsInit();

% Задание рабочей точки транзисторов
    % Транзистор токового зеркала
        Id0  = 10e-3;
        Uds0 = 0.45;
        Ugs0  = 0.71514;
    % Нижняя пара транзисторов
        Id1  = 5e-3;
        Uds1 = 0.45;
        Ugs1  = 0.667175;
    % Верхняя четверка транзисторов
        Id2  = 2.5e-3;
        Uds2 = 0.45;
        Ugs2  = 0.629441;

% Резистор токового зеркала
    R2 = (Params.E - Ugs0) / Id0;

% Верхние резисторы
    R1 = (Params.E - Uds0 - Uds1 - Uds2) / Id1;

% Верхний источник смещения
    V5 = Uds0 + Uds1 + Ugs2;
% Нижний источник смещения
    V6 = Uds0 + Ugs1;

% ---------------------------------------------------------------------- %

    fprintf('%s Mixer calculated\n', datestr(now));
